cours/journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2022-10-03 lun. 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Compilation 2022/2023 &#x2013; Journal du cours</title>
<meta name="author" content="Adrien Guatto" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Compilation 2022/2023 &#x2013; Journal du cours</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdedff49">1. Cours 1 : Introduction <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-12 lun.&gt;</span></span></a>
<ul>
<li><a href="#org13f94c0">1.1. Présentation</a></li>
<li><a href="#org45a42a1">1.2. Contenu et objectifs du cours</a>
<ul>
<li><a href="#org31fde98">1.2.1. Introduction au cours</a></li>
<li><a href="#orgeff4027">1.2.2. Pourquoi étudier la compilation ?</a></li>
</ul>
</li>
<li><a href="#orgc77fc89">1.3. Fonctionnement du cours</a></li>
<li><a href="#orgfc4cbf8">1.4. Introduction à la compilation : le micro-langage Marthe</a></li>
<li><a href="#orgf766da1">1.5. À préparer pour le prochain TP et le prochain cours</a>
<ul>
<li><a href="#org0f384b0">1.5.1. <span class="todo TODO">TODO</span> Prochaine séance de travaux pratiques</a></li>
<li><a href="#org95ce2a6">1.5.2. <span class="todo TODO">TODO</span> S'inscrire sur la liste de diffusion du cours</a></li>
<li><a href="#org0384faf">1.5.3. <span class="todo TODO">TODO</span> Prochain séance de cours</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d8b201">2. Cours 2 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-19 lun.&gt;</span></span></a>
<ul>
<li><a href="#org748cc14">2.1. Message de service</a></li>
<li><a href="#org3b22c1b">2.2. Le retour de Marthe</a></li>
<li><a href="#org9724ddb">2.3. Le cours 2</a></li>
<li><a href="#orgc938793">2.4. À préparer pour le prochain TP et le prochain cours</a>
<ul>
<li><a href="#org609f113">2.4.1. <span class="todo TODO">TODO</span> Lire la documentation des outils ocamllex et Menhir</a></li>
<li><a href="#orgaecf2c2">2.4.2. <span class="todo TODO">TODO</span> Préparer le dépôt du projet</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2cc42e0">3. Cours 03 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-26 lun.&gt;</span></span></a>
<ul>
<li><a href="#org0bc8d0d">3.1. Introduction au jalon 1 et au compilateur flap</a></li>
<li><a href="#org5b5cabe">3.2. La prochaine fois</a></li>
</ul>
</li>
<li><a href="#org034fdad">4. Cours 04 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-10-03 lun.&gt;</span></span></a>
<ul>
<li><a href="#orga8094a3">4.1. Suivi du projet</a>
<ul>
<li><a href="#orgcce5ed1">4.1.1. Pourquoi n'y a-t-il pas de <code>if &lt;expr&gt; then &lt;expr&gt;</code> dans l'AST Hopix ?</a></li>
<li><a href="#org4aadf97">4.1.2. Comment gérer les positions ?</a></li>
<li><a href="#org6482fd7">4.1.3. Questions diverses</a></li>
</ul>
</li>
<li><a href="#org487234e">4.2. Introduction à la théorie des langages de programmation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Ce fichier est disponible au
<a href="https://www.irif.fr/~guatto/teaching/22-23/compilation/journal.html">format
HTML</a>.
</p>

<div id="outline-container-orgdedff49" class="outline-2">
<h2 id="orgdedff49"><span class="section-number-2">1.</span> Cours 1 : Introduction <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-12 lun.&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org13f94c0" class="outline-3">
<h3 id="org13f94c0"><span class="section-number-3">1.1.</span> Présentation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Bienvenue en Master 1 !
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Séance</th>
<th scope="col" class="org-left">Enseignant</th>
<th scope="col" class="org-left">Horaire</th>
<th scope="col" class="org-left">Salle</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Cours</td>
<td class="org-left"><a href="mailto:guatto@irif.fr">Adrien Guatto</a></td>
<td class="org-left">lundi 10h45-12h45</td>
<td class="org-left">SG 1003</td>
</tr>

<tr>
<td class="org-left">TP</td>
<td class="org-left"><a href="mailto:haberm@irif.fr">Peter Habermehl</a></td>
<td class="org-left">vendredi 8h30-10h30</td>
<td class="org-left">SG 2031</td>
</tr>
</tbody>
</table>

<p>
<b>Attention</b> : les séances de TP commencent la même semaine que les cours !
</p>
</div>
</div>
<div id="outline-container-org45a42a1" class="outline-3">
<h3 id="org45a42a1"><span class="section-number-3">1.2.</span> Contenu et objectifs du cours</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org31fde98" class="outline-4">
<h4 id="org31fde98"><span class="section-number-4">1.2.1.</span> Introduction au cours</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
En licence, vous avez acquis les bases de l'informatique : appris à
programmer dans plusieurs langages, découvert l'algorithmique sous diverses
formes, vous êtes familiarisés avec l'utilisation d'un système UNIX, etc.
</p>

<p>
En master, on ouvre les boîtes noires ! Par exemple, le cours d'architecture
des ordinateurs vous initie au fonctionnement interne d'un processeur.
</p>

<p>
Dans ce cours, on ouvre la boîte noire des langages de programmation :
comment fonctionne un compilateur ? Comment passer d'un fichier texte
contenant du code source à un programme que votre processeur peut exécuter ?
</p>

<p>
Comprendre le fonctionnement des compilateurs est l'objectif affiché du
cours. Il y en a un deuxième, un peu caché : vous faire programmer, et
beaucoup ! Vous allez écrire un compilateur, en OCaml, tout au long du
semestre, en binôme, de façon guidée. Vous allez pour ce faire utiliser des
méthodes et outils de développement modernes : gestion de version, tests,
intégration continue, etc.
</p>
</div>
</div>
<div id="outline-container-orgeff4027" class="outline-4">
<h4 id="orgeff4027"><span class="section-number-4">1.2.2.</span> Pourquoi étudier la compilation ?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Ce n'est pas une compétence directement mobilisable dans la plupart des
emplois de développeur, même si la demande pour des experts en compilation
est forte à l'international (exemple : compilation de JavaScript).
</p>

<p>
Mais comprendre comment fonctionne un compilateur vous transformera en des
programmeurs plus mûrs, qui maîtrisent les fondements de leurs outils. C'est
une aide concrète lorsqu'on programme, et notamment lorsqu'on débogue et
qu'on a besoin de regarder ``sous le capot''.
</p>

<p>
De plus, la compilation est un sujet pluridisciplinaire :
</p>
<ul class="org-ul">
<li>architecture des ordinateurs,</li>
<li>théorie des graphes</li>
<li>théorie des langages et automates,</li>
<li>sémantique des langages de programmation,</li>
<li>génie logiciel,</li>
<li>méthodes formelles&#x2026;</li>
</ul>
<p>
Vous allez donc mettre en pratique et revisiter certains concepts que vous
avez vu dans d'autres cours, ce qui peut vous aider à les assimiler.
</p>

<p>
Il va sans dire que la réalisation du projet va aussi beaucoup augmenter
votre expérience de la programmation. Ce sera pour la majorité d'entre vous
l'occasion de vous confronter pour la première fois à une base de code
réaliste !
</p>
</div>
</div>
</div>
<div id="outline-container-orgc77fc89" class="outline-3">
<h3 id="orgc77fc89"><span class="section-number-3">1.3.</span> Fonctionnement du cours</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Vous avez tous reçu une copie de la description du cours (son <i>syllabus</i>,
dans le jargon), aussi disponible en ligne sur la page du cours. Prenons le
temps de le lire ensemble.
</p>

<p>
Il se dégage plusieurs principes.
</p>

<ul class="org-ul">
<li>Les séances de cours sont centrées sur la réalisation du projet, qui
oriente les concepts que je vais présenter et nos discussions. Elles se
veulent interactives et ouvertes à la discussion.</li>

<li>Le projet est structuré en grandes étapes indépendantes, les <i>jalons</i>, qui
prennent la forme de code à trou : il faudra lire autant qu'écrire !</li>

<li>Vous aurez les énoncés des jalons rapidement, et chaque séance de cours
débutera par 15 à 30 minutes de travail collectif au sujet des questions
que vous aurez préparées au sujet des jalons.</li>

<li>Le bon fonctionnement des jalons sera évalué par une batterie de tests
automatiques.</li>
</ul>

<p>
Pour que le cours fonctionne, vos enseignants attendent de vous :
</p>

<ul class="org-ul">
<li>que vous travailliez de façon continue et régulière tout le semestre,</li>

<li>que vous rendiez vos jalons à temps (toutes les trois semaines environ),</li>

<li>que vous prêtiez attention à la qualité du code,</li>

<li>en cours : que vous preniez des notes tout en réfléchissant et questionnant
de façon critique la discussion,</li>

<li>en TP : que vous posiez des questions et discutiez avec l'enseignant et vos
camarades,</li>

<li>chez vous : que vous lisiez le code du projet ainsi que les documents
obligatoires et conseillées, que vous programmiez.</li>
</ul>

<p>
L'évaluation se fera sur votre compréhension du projet, estimée pour 70% par
la soutenance, pour 30% par un examen. La soutenance est individuelle, on
vous demandera d'expliquer votre code, et la qualité de celui-ci sera prise
en compte.
</p>
</div>
</div>
<div id="outline-container-orgfc4cbf8" class="outline-3">
<h3 id="orgfc4cbf8"><span class="section-number-3">1.4.</span> Introduction à la compilation : le micro-langage Marthe</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Le reste de la séance est consacré à la lecture et discussion d'un
micro-langage de programmation, Marthe. Voir le fichier
<a href="cours-01/marthe.ml">marthe.ml</a>.
</p>
</div>
</div>
<div id="outline-container-orgf766da1" class="outline-3">
<h3 id="orgf766da1"><span class="section-number-3">1.5.</span> À préparer pour le prochain TP et le prochain cours</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org0f384b0" class="outline-4">
<h4 id="org0f384b0"><span class="section-number-4">1.5.1.</span> <span class="todo TODO">TODO</span> Prochaine séance de travaux pratiques</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Venir avec son ordinateur portable, vendredi</li>
<li>S'assurer que celui-ci dispose d'un environnement de développement OCaml
fonctionnel (compilateur OCaml, OPAM, dune).</li>
</ul>
</div>
</div>
<div id="outline-container-org95ce2a6" class="outline-4">
<h4 id="org95ce2a6"><span class="section-number-4">1.5.2.</span> <span class="todo TODO">TODO</span> S'inscrire sur la liste de diffusion du cours</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
<a href="https://listes.u-paris.fr/wws/info/m1.2022.compilation.info">https://listes.u-paris.fr/wws/info/m1.2022.compilation.info</a>
</p>
</div>
</div>
<div id="outline-container-org0384faf" class="outline-4">
<h4 id="org0384faf"><span class="section-number-4">1.5.3.</span> <span class="todo TODO">TODO</span> Prochain séance de cours</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li>Finir la gestion des commentaires dans <code>marthe.ml</code>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org3d8b201" class="outline-2">
<h2 id="org3d8b201"><span class="section-number-2">2.</span> Cours 2 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-19 lun.&gt;</span></span></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org748cc14" class="outline-3">
<h3 id="org748cc14"><span class="section-number-3">2.1.</span> Message de service</h3>
<div class="outline-text-3" id="text-2-1">
<p>
La liste a été configurée correctement, les étudiants et étudiantes peuvent
désormais s'inscrire avec leur adresse courriel favorite.
</p>

<p>
<a href="https://listes.u-paris.fr/wws/info/m1.2022.compilation.info">https://listes.u-paris.fr/wws/info/m1.2022.compilation.info</a>
</p>
</div>
</div>
<div id="outline-container-org3b22c1b" class="outline-3">
<h3 id="org3b22c1b"><span class="section-number-3">2.2.</span> Le retour de Marthe</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Dans <a href="cours-01/marthe.ml">marthe.ml</a>, on ajoute les commentaires à
l'analyseur lexical, et on lit l'analyseur syntaxique.
</p>
</div>
</div>
<div id="outline-container-org9724ddb" class="outline-3">
<h3 id="org9724ddb"><span class="section-number-3">2.3.</span> Le cours 2</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Voir les <a href="cours-02/cours-02-parsing.pdf">transparents</a>.
</p>
</div>
</div>
<div id="outline-container-orgc938793" class="outline-3">
<h3 id="orgc938793"><span class="section-number-3">2.4.</span> À préparer pour le prochain TP et le prochain cours</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org609f113" class="outline-4">
<h4 id="org609f113"><span class="section-number-4">2.4.1.</span> <span class="todo TODO">TODO</span> Lire la documentation des outils ocamllex et Menhir</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li><a href="https://caml.inria.fr/pub/docs/manual-ocaml/lexyacc.html">https://caml.inria.fr/pub/docs/manual-ocaml/lexyacc.html</a></li>
<li><a href="http://pauillac.inria.fr/~fpottier/menhir/manual.pdf">http://pauillac.inria.fr/~fpottier/menhir/manual.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaecf2c2" class="outline-4">
<h4 id="orgaecf2c2"><span class="section-number-4">2.4.2.</span> <span class="todo TODO">TODO</span> Préparer le dépôt du projet</h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>Forker le dépôt Git du projet</li>
</ul>
<p>
<a href="https://gaufre.informatique.univ-paris-diderot.fr/aguatto/compilation-m1-2022">https://gaufre.informatique.univ-paris-diderot.fr/aguatto/compilation-m1-2022</a>
</p>
<ul class="org-ul">
<li>Passer votre fork du dépôt en visibilité privée</li>
<li>Ajouter l'accès à l'équipe enseignante
<ul class="org-ul">
<li>Adrien Guatto @aguatto</li>
<li>Peter Habermehl @habermeh</li>
</ul></li>
<li>Remplir le fichier AUTEURS du dépôt</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org2cc42e0" class="outline-2">
<h2 id="org2cc42e0"><span class="section-number-2">3.</span> Cours 03 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-26 lun.&gt;</span></span></h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0bc8d0d" class="outline-3">
<h3 id="org0bc8d0d"><span class="section-number-3">3.1.</span> Introduction au jalon 1 et au compilateur flap</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Voir le <a href="../flap">code</a> du compilateur Flap, ainsi que l'énoncé du
<a href="../jalons/jalon-1.pdf">jalon 1</a>.
</p>
</div>
</div>
<div id="outline-container-org5b5cabe" class="outline-3">
<h3 id="org5b5cabe"><span class="section-number-3">3.2.</span> La prochaine fois</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>On terminera de lire <code>marthe.ml</code>.</li>

<li>On commencera une séquence de cours au sujet des langages de programmation.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org034fdad" class="outline-2">
<h2 id="org034fdad"><span class="section-number-2">4.</span> Cours 04 <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-10-03 lun.&gt;</span></span></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga8094a3" class="outline-3">
<h3 id="orga8094a3"><span class="section-number-3">4.1.</span> Suivi du projet</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgcce5ed1" class="outline-4">
<h4 id="orgcce5ed1"><span class="section-number-4">4.1.1.</span> Pourquoi n'y a-t-il pas de <code>if &lt;expr&gt; then &lt;expr&gt;</code> dans l'AST Hopix ?</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Une partie du <i>sucre syntaxique</i> est éliminée lors de l'analyse
syntaxique. C'est le cas du <code>if &lt;expr&gt; then &lt;expr&gt;</code> qui se <i>désucre</i> de la
même façon que celui d'OCaml.
</p>
</div>
</div>
<div id="outline-container-org4aadf97" class="outline-4">
<h4 id="org4aadf97"><span class="section-number-4">4.1.2.</span> Comment gérer les positions ?</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Menhir ne connaît pas le fichier source, uniquement le <code>lexbuf</code>. C'est donc
à l'analyseur lexical de remplir ce dernier correctement pour que
l'analyseur syntaxique puisse avoir accès à l'information de position. Voir
le type <code>Lexing.lexbuf</code> pour cette information de position.
</p>

<p>
L'analyseur lexical doit essentiellement détecter les nouvelles lignes pour
mettre à jour le <code>lexbuf</code>. Cf. <code>Lexing.new_line</code>, déjà utilisée dans le
fichier l'analyseur lexical fourni.
</p>

<p>
Les règles de l'analyseur syntaxique peut ensuite utiliser les variables
Menhir <code>$startpos</code> et <code>$endpos</code>. Dans le fichier fourni, leur utilisation
passera par la règle paramétrique <code>located(X)</code>.
</p>

<div class="VERBATIM" id="org5cb52cd">
<p>
%inline located(X): x=X {
  Position.with_poss $startpos $endpos x
}
</p>

</div>

<p>
On peut utiliser cette règle pour analyser une valeur de type <code>'a
    located</code>. Par exemple, le non-terminal <code>located(expression)</code> produit une
valeur de type <code>'a located</code>.
</p>
</div>
</div>
<div id="outline-container-org6482fd7" class="outline-4">
<h4 id="org6482fd7"><span class="section-number-4">4.1.3.</span> Questions diverses</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
J'apporte quelques précisions à l'énoncé du jalon 1.
</p>
</div>
</div>
</div>
<div id="outline-container-org487234e" class="outline-3">
<h3 id="org487234e"><span class="section-number-3">4.2.</span> Introduction à la théorie des langages de programmation</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Voir la première partie des
<a href="cours-04-à-06/cours-04-à-06-intro-semantique-typage.pdf">transparents</a>
dédiés. La substitution (derniers transparents) sera traitée à la prochaine
séance.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Adrien Guatto</p>
<p class="date">Created: 2022-10-03 lun. 14:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
